# coding:utf8

"""
Created on 2016年3月7日

@author: dict
"""

city = {"中卫": "ZHY", "三明": "SQJ", "荔波": "LLB", "九寨沟": "JZH", "长白山": "NBS", 
        "乌兰浩特": "HLH", "神农架": "HPG", "延安": "ENY", "济宁": "JNG", "凯里": "KJH", 
        "成都": "CTU", "太原": "TYN", "临汾": "LFQ", "吕梁": "LLV", "池州": "JUH", 
        "梁平": "LIA", "百色": "AEB", "恩施": "ENH", "忻州": "WUT", "大连": "DLC", 
        "额济纳旗": "EJN", "安顺": "AVA", "宜昌": "YIH", "和田": "HTN", "贵阳": "KWE", 
        "东营": "DOY", "赣州": "KOW", "三亚": "SYX", "阿尔山": "YIE", "拉萨": "LXA", 
        "嘉峪关": "JGN", "鸡西": "JXA", "锦州": "JNZ", "西昌": "XIC", "日喀则": "RKZ", 
        "郑州": "CGO", "黑河": "HEK", "花土沟": "HTT", "大同": "DAT", "汉中": "HZG", 
        "广元": "GYS", "潍坊": "WEF", "德令哈": "HXD", "富蕴": "FYN", "包头": "BAV", 
        "普洱": "SYM", "荆州": "SHS", "通辽": "TGO", "深圳": "SZX", "常德": "CGD", 
        "邯郸": "HDG", "伊春": "LDS", "台州": "HYN", "厦门": "XMN", "林芝": "LZY", 
        "九江": "JIU", "库车": "KCA", "六盘水": "LPF", "塔城": "TCG", "宜春": "YIC", 
        "晋江": "JJN", "赤峰": "CIF", "南通": "NTG", "康定": "KGT", "宁蒗": "NLH", 
        "常州": "CZX", "库尔勒": "KRL", "梧州": "WUZ", "徐州": "XUZ", "南宁": "NNG", 
        "海拉尔": "HLD", "青岛": "TAO", "运城": "YCU", "营口": "YKH", "丹东": "DDG", 
        "加格达奇": "JGD", "德宏": "LUM", "玉树": "YUS", "泸州": "LZO", "喀什": "KHG", 
        "淮安": "HIA", "兴义": "ACX", "攀枝花": "PZI", "西双版纳": "JHG", "毕节": "BFJ", 
        "乌鲁木齐": "URC", "石家庄": "SJW", "广汉": "GHN", "满洲里": "NZH", "喀纳斯": "KJI", 
        "珠海": "ZUH", "盐城": "YNZ", "武夷山": "WUS", "泰州": "YTY", "合肥": "HFE", 
        "临沧": "LNJ", "哈尔滨": "HRB", "阜阳": "FUG", "景德镇": "JDZ", "西安": "SIA", 
        "长海": "CNI", "天水": "THQ", "大理": "DLU", "重庆": "CKG", "巴彦淖尔": "RLK", 
        "沈阳": "SHE", "怀化": "HJJ", "且末": "IQM", "张家口": "ZQZ", "阿勒泰": "AAT", 
        "金昌": "JIC", "潮州": "SWA", "琼海": "BAR", "北京": "BJS", "夏河": "GXH", 
        "博乐": "BPL", "武汉": "WUH", "南充": "NAO", "阿里": "NGQ", "上海": "SHA", 
        "鞍山": "AOG", "文山": "WNH", "杭州": "HGH", "湛江": "ZHA", "红原": "AHJ", 
        "黔江": "JIQ", "牡丹江": "MDG", "永州": "LLF", "乌海": "WUA", "宁波": "NGB", 
        "呼和浩特": "HET", "光化": "LHK", "西宁": "XNN", "固原": "GYU", "绵阳": "MIG", 
        "林西": "LXI", "那拉提": "NLT", "石河子": "SHF", "桂林": "KWL", "昌都": "BPX", 
        "河池": "HCJ", "丽江": "LJG", "十堰": "WDS", "保山": "BSD", "义乌": "YIW", 
        "齐齐哈尔": "NDG", "阿拉善右旗": "RHT", "鄂尔多斯": "DSN", "敦煌": "DNH", "广州": "CAN", 
        "临沂": "LYI", "铜仁": "TEN", "衢州": "JUZ", "济南": "TNA", "漠河": "OHE", 
        "稻城": "DCY", "伊宁": "YIN", "延吉": "YNJ", "庆阳": "IQN", "连云港": "LYG", 
        "梅州": "MXZ", "南京": "NKG", "昭通": "ZAT", "哈密": "HMI", "长春": "CGQ", 
        "温州": "WNZ", "格尔木": "GOQ", "腾冲": "TCZ", "佛山": "FUO", "井冈山": "JGS", 
        "咸阳": "SIA", "南阳": "NNY", "柳州": "LZH", "芒市": "LUM", "张家界": "DYG", 
        "惠州": "HUZ", "榆林": "UYN", "长沙": "CSX", "抚远": "FYJ", "迪庆": "DIG", 
        "克拉玛依": "KRY", "大庆": "DQA", "昆明": "KMG", "洛阳": "LYA", "朝阳": "CHG", 
        "衡阳": "HNY", "佳木斯": "JMU", "阿克苏": "AKU", "扬州": "YTY", "黄山": "TXN", 
        "二连浩特": "ERL", "黎平": "HZH", "烟台": "YNT", "通化": "TNH", "揭阳": "SWA", 
        "长治": "CIH", "海口": "HAK", "南昌": "KHN", "遵义": "ZYI", "达县": "DAX", 
        "中山": "ZGN", "威海": "WEH", "阿拉善左旗": "AXF", "张掖": "YZY", "天津": "TSN", 
        "泉州": "JJN", "襄阳": "XFN", "安康": "AKA", "北海": "BHY", "日照": "RIZ", 
        "兰州": "LHW", "汕头": "SWA", "唐山": "TVS", "吐鲁番": "TLQ", "安庆": "AQG", 
        "秦皇岛": "SHP", "舟山": "HSN", "锡林浩特": "XIL", "宜宾": "YBP", "无锡": "WUX", 
        "万州": "WXN", "龙岩": "LCX", "福州": "FOC", "银川": "INC"}
# num = [11,13,17,19,23,29,31]
# for x1 in num:
#     for x2 in num:
#         for x3 in num:
#             for x4 in num:
#                 for x5 in num:
#                     for x6 in num:
#                         for x7 in num:
#                             flag = [0] * 35
#                             fl = 1
#                             for x in (x1,x2,x3,x4,x5,x6,x7):
#                                 if (flag[x] == 0) :
#                                    flag[x] = 1
#                                 else:
#                                     fl = 0
#                                     break
#                             if fl :
#                                 s1 = x1 + x2 +x3 + x4
#                                 s2 = x2 + x3 +x5 + x6
#                                 s3 = x4 + x7 +x5 + x6
#                                 if (s1 == s2 & s2 == s3):
#                                     print "%d %d %d %d %d %d %d " % (x1,x2,x3,x4,x5,x6,x7)